name: ""
layer {
  name: "lstm1_Input_x"
  type: "Input"
  top: "x"
  top: "cont"
  phase: TEST
  input_param {
    shape {
      dim: 80
      dim: 512
      dim: 3
      dim: 30
    }
    shape {
      dim: 80
      dim: 512
    }
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "lstm1_Input_c0h0"
  type: "Input"
  top: "c_0"
  top: "h_0"
  phase: TEST
  input_param {
    shape {
      dim: 1
      dim: 512
      dim: 100
    }
    shape {
      dim: 1
      dim: 512
      dim: 100
    }
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 0
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_cont_slice"
  type: "SliceRistretto"
  bottom: "cont"
  top: "cont_1"
  top: "cont_2"
  top: "cont_3"
  top: "cont_4"
  top: "cont_5"
  top: "cont_6"
  top: "cont_7"
  top: "cont_8"
  top: "cont_9"
  top: "cont_10"
  top: "cont_11"
  top: "cont_12"
  top: "cont_13"
  top: "cont_14"
  top: "cont_15"
  top: "cont_16"
  top: "cont_17"
  top: "cont_18"
  top: "cont_19"
  top: "cont_20"
  top: "cont_21"
  top: "cont_22"
  top: "cont_23"
  top: "cont_24"
  top: "cont_25"
  top: "cont_26"
  top: "cont_27"
  top: "cont_28"
  top: "cont_29"
  top: "cont_30"
  top: "cont_31"
  top: "cont_32"
  top: "cont_33"
  top: "cont_34"
  top: "cont_35"
  top: "cont_36"
  top: "cont_37"
  top: "cont_38"
  top: "cont_39"
  top: "cont_40"
  top: "cont_41"
  top: "cont_42"
  top: "cont_43"
  top: "cont_44"
  top: "cont_45"
  top: "cont_46"
  top: "cont_47"
  top: "cont_48"
  top: "cont_49"
  top: "cont_50"
  top: "cont_51"
  top: "cont_52"
  top: "cont_53"
  top: "cont_54"
  top: "cont_55"
  top: "cont_56"
  top: "cont_57"
  top: "cont_58"
  top: "cont_59"
  top: "cont_60"
  top: "cont_61"
  top: "cont_62"
  top: "cont_63"
  top: "cont_64"
  top: "cont_65"
  top: "cont_66"
  top: "cont_67"
  top: "cont_68"
  top: "cont_69"
  top: "cont_70"
  top: "cont_71"
  top: "cont_72"
  top: "cont_73"
  top: "cont_74"
  top: "cont_75"
  top: "cont_76"
  top: "cont_77"
  top: "cont_78"
  top: "cont_79"
  top: "cont_80"
  phase: TEST
  slice_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_1_lstm1_cont_slice_0_split"
  type: "Split"
  bottom: "cont_1"
  top: "cont_1_lstm1_cont_slice_0_split_0"
  top: "cont_1_lstm1_cont_slice_0_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_2_lstm1_cont_slice_1_split"
  type: "Split"
  bottom: "cont_2"
  top: "cont_2_lstm1_cont_slice_1_split_0"
  top: "cont_2_lstm1_cont_slice_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_3_lstm1_cont_slice_2_split"
  type: "Split"
  bottom: "cont_3"
  top: "cont_3_lstm1_cont_slice_2_split_0"
  top: "cont_3_lstm1_cont_slice_2_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_4_lstm1_cont_slice_3_split"
  type: "Split"
  bottom: "cont_4"
  top: "cont_4_lstm1_cont_slice_3_split_0"
  top: "cont_4_lstm1_cont_slice_3_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_5_lstm1_cont_slice_4_split"
  type: "Split"
  bottom: "cont_5"
  top: "cont_5_lstm1_cont_slice_4_split_0"
  top: "cont_5_lstm1_cont_slice_4_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_6_lstm1_cont_slice_5_split"
  type: "Split"
  bottom: "cont_6"
  top: "cont_6_lstm1_cont_slice_5_split_0"
  top: "cont_6_lstm1_cont_slice_5_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_7_lstm1_cont_slice_6_split"
  type: "Split"
  bottom: "cont_7"
  top: "cont_7_lstm1_cont_slice_6_split_0"
  top: "cont_7_lstm1_cont_slice_6_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_8_lstm1_cont_slice_7_split"
  type: "Split"
  bottom: "cont_8"
  top: "cont_8_lstm1_cont_slice_7_split_0"
  top: "cont_8_lstm1_cont_slice_7_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_9_lstm1_cont_slice_8_split"
  type: "Split"
  bottom: "cont_9"
  top: "cont_9_lstm1_cont_slice_8_split_0"
  top: "cont_9_lstm1_cont_slice_8_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_10_lstm1_cont_slice_9_split"
  type: "Split"
  bottom: "cont_10"
  top: "cont_10_lstm1_cont_slice_9_split_0"
  top: "cont_10_lstm1_cont_slice_9_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_11_lstm1_cont_slice_10_split"
  type: "Split"
  bottom: "cont_11"
  top: "cont_11_lstm1_cont_slice_10_split_0"
  top: "cont_11_lstm1_cont_slice_10_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_12_lstm1_cont_slice_11_split"
  type: "Split"
  bottom: "cont_12"
  top: "cont_12_lstm1_cont_slice_11_split_0"
  top: "cont_12_lstm1_cont_slice_11_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_13_lstm1_cont_slice_12_split"
  type: "Split"
  bottom: "cont_13"
  top: "cont_13_lstm1_cont_slice_12_split_0"
  top: "cont_13_lstm1_cont_slice_12_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_14_lstm1_cont_slice_13_split"
  type: "Split"
  bottom: "cont_14"
  top: "cont_14_lstm1_cont_slice_13_split_0"
  top: "cont_14_lstm1_cont_slice_13_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_15_lstm1_cont_slice_14_split"
  type: "Split"
  bottom: "cont_15"
  top: "cont_15_lstm1_cont_slice_14_split_0"
  top: "cont_15_lstm1_cont_slice_14_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_16_lstm1_cont_slice_15_split"
  type: "Split"
  bottom: "cont_16"
  top: "cont_16_lstm1_cont_slice_15_split_0"
  top: "cont_16_lstm1_cont_slice_15_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_17_lstm1_cont_slice_16_split"
  type: "Split"
  bottom: "cont_17"
  top: "cont_17_lstm1_cont_slice_16_split_0"
  top: "cont_17_lstm1_cont_slice_16_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_18_lstm1_cont_slice_17_split"
  type: "Split"
  bottom: "cont_18"
  top: "cont_18_lstm1_cont_slice_17_split_0"
  top: "cont_18_lstm1_cont_slice_17_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_19_lstm1_cont_slice_18_split"
  type: "Split"
  bottom: "cont_19"
  top: "cont_19_lstm1_cont_slice_18_split_0"
  top: "cont_19_lstm1_cont_slice_18_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_20_lstm1_cont_slice_19_split"
  type: "Split"
  bottom: "cont_20"
  top: "cont_20_lstm1_cont_slice_19_split_0"
  top: "cont_20_lstm1_cont_slice_19_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_21_lstm1_cont_slice_20_split"
  type: "Split"
  bottom: "cont_21"
  top: "cont_21_lstm1_cont_slice_20_split_0"
  top: "cont_21_lstm1_cont_slice_20_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_22_lstm1_cont_slice_21_split"
  type: "Split"
  bottom: "cont_22"
  top: "cont_22_lstm1_cont_slice_21_split_0"
  top: "cont_22_lstm1_cont_slice_21_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_23_lstm1_cont_slice_22_split"
  type: "Split"
  bottom: "cont_23"
  top: "cont_23_lstm1_cont_slice_22_split_0"
  top: "cont_23_lstm1_cont_slice_22_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_24_lstm1_cont_slice_23_split"
  type: "Split"
  bottom: "cont_24"
  top: "cont_24_lstm1_cont_slice_23_split_0"
  top: "cont_24_lstm1_cont_slice_23_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_25_lstm1_cont_slice_24_split"
  type: "Split"
  bottom: "cont_25"
  top: "cont_25_lstm1_cont_slice_24_split_0"
  top: "cont_25_lstm1_cont_slice_24_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_26_lstm1_cont_slice_25_split"
  type: "Split"
  bottom: "cont_26"
  top: "cont_26_lstm1_cont_slice_25_split_0"
  top: "cont_26_lstm1_cont_slice_25_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_27_lstm1_cont_slice_26_split"
  type: "Split"
  bottom: "cont_27"
  top: "cont_27_lstm1_cont_slice_26_split_0"
  top: "cont_27_lstm1_cont_slice_26_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_28_lstm1_cont_slice_27_split"
  type: "Split"
  bottom: "cont_28"
  top: "cont_28_lstm1_cont_slice_27_split_0"
  top: "cont_28_lstm1_cont_slice_27_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_29_lstm1_cont_slice_28_split"
  type: "Split"
  bottom: "cont_29"
  top: "cont_29_lstm1_cont_slice_28_split_0"
  top: "cont_29_lstm1_cont_slice_28_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_30_lstm1_cont_slice_29_split"
  type: "Split"
  bottom: "cont_30"
  top: "cont_30_lstm1_cont_slice_29_split_0"
  top: "cont_30_lstm1_cont_slice_29_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_31_lstm1_cont_slice_30_split"
  type: "Split"
  bottom: "cont_31"
  top: "cont_31_lstm1_cont_slice_30_split_0"
  top: "cont_31_lstm1_cont_slice_30_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_32_lstm1_cont_slice_31_split"
  type: "Split"
  bottom: "cont_32"
  top: "cont_32_lstm1_cont_slice_31_split_0"
  top: "cont_32_lstm1_cont_slice_31_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_33_lstm1_cont_slice_32_split"
  type: "Split"
  bottom: "cont_33"
  top: "cont_33_lstm1_cont_slice_32_split_0"
  top: "cont_33_lstm1_cont_slice_32_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_34_lstm1_cont_slice_33_split"
  type: "Split"
  bottom: "cont_34"
  top: "cont_34_lstm1_cont_slice_33_split_0"
  top: "cont_34_lstm1_cont_slice_33_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_35_lstm1_cont_slice_34_split"
  type: "Split"
  bottom: "cont_35"
  top: "cont_35_lstm1_cont_slice_34_split_0"
  top: "cont_35_lstm1_cont_slice_34_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_36_lstm1_cont_slice_35_split"
  type: "Split"
  bottom: "cont_36"
  top: "cont_36_lstm1_cont_slice_35_split_0"
  top: "cont_36_lstm1_cont_slice_35_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_37_lstm1_cont_slice_36_split"
  type: "Split"
  bottom: "cont_37"
  top: "cont_37_lstm1_cont_slice_36_split_0"
  top: "cont_37_lstm1_cont_slice_36_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_38_lstm1_cont_slice_37_split"
  type: "Split"
  bottom: "cont_38"
  top: "cont_38_lstm1_cont_slice_37_split_0"
  top: "cont_38_lstm1_cont_slice_37_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_39_lstm1_cont_slice_38_split"
  type: "Split"
  bottom: "cont_39"
  top: "cont_39_lstm1_cont_slice_38_split_0"
  top: "cont_39_lstm1_cont_slice_38_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_40_lstm1_cont_slice_39_split"
  type: "Split"
  bottom: "cont_40"
  top: "cont_40_lstm1_cont_slice_39_split_0"
  top: "cont_40_lstm1_cont_slice_39_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_41_lstm1_cont_slice_40_split"
  type: "Split"
  bottom: "cont_41"
  top: "cont_41_lstm1_cont_slice_40_split_0"
  top: "cont_41_lstm1_cont_slice_40_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_42_lstm1_cont_slice_41_split"
  type: "Split"
  bottom: "cont_42"
  top: "cont_42_lstm1_cont_slice_41_split_0"
  top: "cont_42_lstm1_cont_slice_41_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_43_lstm1_cont_slice_42_split"
  type: "Split"
  bottom: "cont_43"
  top: "cont_43_lstm1_cont_slice_42_split_0"
  top: "cont_43_lstm1_cont_slice_42_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_44_lstm1_cont_slice_43_split"
  type: "Split"
  bottom: "cont_44"
  top: "cont_44_lstm1_cont_slice_43_split_0"
  top: "cont_44_lstm1_cont_slice_43_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_45_lstm1_cont_slice_44_split"
  type: "Split"
  bottom: "cont_45"
  top: "cont_45_lstm1_cont_slice_44_split_0"
  top: "cont_45_lstm1_cont_slice_44_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_46_lstm1_cont_slice_45_split"
  type: "Split"
  bottom: "cont_46"
  top: "cont_46_lstm1_cont_slice_45_split_0"
  top: "cont_46_lstm1_cont_slice_45_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_47_lstm1_cont_slice_46_split"
  type: "Split"
  bottom: "cont_47"
  top: "cont_47_lstm1_cont_slice_46_split_0"
  top: "cont_47_lstm1_cont_slice_46_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_48_lstm1_cont_slice_47_split"
  type: "Split"
  bottom: "cont_48"
  top: "cont_48_lstm1_cont_slice_47_split_0"
  top: "cont_48_lstm1_cont_slice_47_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_49_lstm1_cont_slice_48_split"
  type: "Split"
  bottom: "cont_49"
  top: "cont_49_lstm1_cont_slice_48_split_0"
  top: "cont_49_lstm1_cont_slice_48_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_50_lstm1_cont_slice_49_split"
  type: "Split"
  bottom: "cont_50"
  top: "cont_50_lstm1_cont_slice_49_split_0"
  top: "cont_50_lstm1_cont_slice_49_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_51_lstm1_cont_slice_50_split"
  type: "Split"
  bottom: "cont_51"
  top: "cont_51_lstm1_cont_slice_50_split_0"
  top: "cont_51_lstm1_cont_slice_50_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_52_lstm1_cont_slice_51_split"
  type: "Split"
  bottom: "cont_52"
  top: "cont_52_lstm1_cont_slice_51_split_0"
  top: "cont_52_lstm1_cont_slice_51_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_53_lstm1_cont_slice_52_split"
  type: "Split"
  bottom: "cont_53"
  top: "cont_53_lstm1_cont_slice_52_split_0"
  top: "cont_53_lstm1_cont_slice_52_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_54_lstm1_cont_slice_53_split"
  type: "Split"
  bottom: "cont_54"
  top: "cont_54_lstm1_cont_slice_53_split_0"
  top: "cont_54_lstm1_cont_slice_53_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_55_lstm1_cont_slice_54_split"
  type: "Split"
  bottom: "cont_55"
  top: "cont_55_lstm1_cont_slice_54_split_0"
  top: "cont_55_lstm1_cont_slice_54_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_56_lstm1_cont_slice_55_split"
  type: "Split"
  bottom: "cont_56"
  top: "cont_56_lstm1_cont_slice_55_split_0"
  top: "cont_56_lstm1_cont_slice_55_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_57_lstm1_cont_slice_56_split"
  type: "Split"
  bottom: "cont_57"
  top: "cont_57_lstm1_cont_slice_56_split_0"
  top: "cont_57_lstm1_cont_slice_56_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_58_lstm1_cont_slice_57_split"
  type: "Split"
  bottom: "cont_58"
  top: "cont_58_lstm1_cont_slice_57_split_0"
  top: "cont_58_lstm1_cont_slice_57_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_59_lstm1_cont_slice_58_split"
  type: "Split"
  bottom: "cont_59"
  top: "cont_59_lstm1_cont_slice_58_split_0"
  top: "cont_59_lstm1_cont_slice_58_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_60_lstm1_cont_slice_59_split"
  type: "Split"
  bottom: "cont_60"
  top: "cont_60_lstm1_cont_slice_59_split_0"
  top: "cont_60_lstm1_cont_slice_59_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_61_lstm1_cont_slice_60_split"
  type: "Split"
  bottom: "cont_61"
  top: "cont_61_lstm1_cont_slice_60_split_0"
  top: "cont_61_lstm1_cont_slice_60_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_62_lstm1_cont_slice_61_split"
  type: "Split"
  bottom: "cont_62"
  top: "cont_62_lstm1_cont_slice_61_split_0"
  top: "cont_62_lstm1_cont_slice_61_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_63_lstm1_cont_slice_62_split"
  type: "Split"
  bottom: "cont_63"
  top: "cont_63_lstm1_cont_slice_62_split_0"
  top: "cont_63_lstm1_cont_slice_62_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_64_lstm1_cont_slice_63_split"
  type: "Split"
  bottom: "cont_64"
  top: "cont_64_lstm1_cont_slice_63_split_0"
  top: "cont_64_lstm1_cont_slice_63_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_65_lstm1_cont_slice_64_split"
  type: "Split"
  bottom: "cont_65"
  top: "cont_65_lstm1_cont_slice_64_split_0"
  top: "cont_65_lstm1_cont_slice_64_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_66_lstm1_cont_slice_65_split"
  type: "Split"
  bottom: "cont_66"
  top: "cont_66_lstm1_cont_slice_65_split_0"
  top: "cont_66_lstm1_cont_slice_65_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_67_lstm1_cont_slice_66_split"
  type: "Split"
  bottom: "cont_67"
  top: "cont_67_lstm1_cont_slice_66_split_0"
  top: "cont_67_lstm1_cont_slice_66_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_68_lstm1_cont_slice_67_split"
  type: "Split"
  bottom: "cont_68"
  top: "cont_68_lstm1_cont_slice_67_split_0"
  top: "cont_68_lstm1_cont_slice_67_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_69_lstm1_cont_slice_68_split"
  type: "Split"
  bottom: "cont_69"
  top: "cont_69_lstm1_cont_slice_68_split_0"
  top: "cont_69_lstm1_cont_slice_68_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_70_lstm1_cont_slice_69_split"
  type: "Split"
  bottom: "cont_70"
  top: "cont_70_lstm1_cont_slice_69_split_0"
  top: "cont_70_lstm1_cont_slice_69_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_71_lstm1_cont_slice_70_split"
  type: "Split"
  bottom: "cont_71"
  top: "cont_71_lstm1_cont_slice_70_split_0"
  top: "cont_71_lstm1_cont_slice_70_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_72_lstm1_cont_slice_71_split"
  type: "Split"
  bottom: "cont_72"
  top: "cont_72_lstm1_cont_slice_71_split_0"
  top: "cont_72_lstm1_cont_slice_71_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_73_lstm1_cont_slice_72_split"
  type: "Split"
  bottom: "cont_73"
  top: "cont_73_lstm1_cont_slice_72_split_0"
  top: "cont_73_lstm1_cont_slice_72_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_74_lstm1_cont_slice_73_split"
  type: "Split"
  bottom: "cont_74"
  top: "cont_74_lstm1_cont_slice_73_split_0"
  top: "cont_74_lstm1_cont_slice_73_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_75_lstm1_cont_slice_74_split"
  type: "Split"
  bottom: "cont_75"
  top: "cont_75_lstm1_cont_slice_74_split_0"
  top: "cont_75_lstm1_cont_slice_74_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_76_lstm1_cont_slice_75_split"
  type: "Split"
  bottom: "cont_76"
  top: "cont_76_lstm1_cont_slice_75_split_0"
  top: "cont_76_lstm1_cont_slice_75_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_77_lstm1_cont_slice_76_split"
  type: "Split"
  bottom: "cont_77"
  top: "cont_77_lstm1_cont_slice_76_split_0"
  top: "cont_77_lstm1_cont_slice_76_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_78_lstm1_cont_slice_77_split"
  type: "Split"
  bottom: "cont_78"
  top: "cont_78_lstm1_cont_slice_77_split_0"
  top: "cont_78_lstm1_cont_slice_77_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_79_lstm1_cont_slice_78_split"
  type: "Split"
  bottom: "cont_79"
  top: "cont_79_lstm1_cont_slice_78_split_0"
  top: "cont_79_lstm1_cont_slice_78_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "cont_80_lstm1_cont_slice_79_split"
  type: "Split"
  bottom: "cont_80"
  top: "cont_80_lstm1_cont_slice_79_split_0"
  top: "cont_80_lstm1_cont_slice_79_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "lstm1_x_transform"
  type: "InnerProductRistretto"
  bottom: "x"
  top: "W_xc_x"
  param {
    name: "W_xc"
  }
  param {
    name: "b_c"
  }
  phase: TEST
  propagate_down: true
  inner_product_param {
    num_output: 400
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 4
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_W_xc_x_slice"
  type: "SliceRistretto"
  bottom: "W_xc_x"
  top: "W_xc_x_1"
  top: "W_xc_x_2"
  top: "W_xc_x_3"
  top: "W_xc_x_4"
  top: "W_xc_x_5"
  top: "W_xc_x_6"
  top: "W_xc_x_7"
  top: "W_xc_x_8"
  top: "W_xc_x_9"
  top: "W_xc_x_10"
  top: "W_xc_x_11"
  top: "W_xc_x_12"
  top: "W_xc_x_13"
  top: "W_xc_x_14"
  top: "W_xc_x_15"
  top: "W_xc_x_16"
  top: "W_xc_x_17"
  top: "W_xc_x_18"
  top: "W_xc_x_19"
  top: "W_xc_x_20"
  top: "W_xc_x_21"
  top: "W_xc_x_22"
  top: "W_xc_x_23"
  top: "W_xc_x_24"
  top: "W_xc_x_25"
  top: "W_xc_x_26"
  top: "W_xc_x_27"
  top: "W_xc_x_28"
  top: "W_xc_x_29"
  top: "W_xc_x_30"
  top: "W_xc_x_31"
  top: "W_xc_x_32"
  top: "W_xc_x_33"
  top: "W_xc_x_34"
  top: "W_xc_x_35"
  top: "W_xc_x_36"
  top: "W_xc_x_37"
  top: "W_xc_x_38"
  top: "W_xc_x_39"
  top: "W_xc_x_40"
  top: "W_xc_x_41"
  top: "W_xc_x_42"
  top: "W_xc_x_43"
  top: "W_xc_x_44"
  top: "W_xc_x_45"
  top: "W_xc_x_46"
  top: "W_xc_x_47"
  top: "W_xc_x_48"
  top: "W_xc_x_49"
  top: "W_xc_x_50"
  top: "W_xc_x_51"
  top: "W_xc_x_52"
  top: "W_xc_x_53"
  top: "W_xc_x_54"
  top: "W_xc_x_55"
  top: "W_xc_x_56"
  top: "W_xc_x_57"
  top: "W_xc_x_58"
  top: "W_xc_x_59"
  top: "W_xc_x_60"
  top: "W_xc_x_61"
  top: "W_xc_x_62"
  top: "W_xc_x_63"
  top: "W_xc_x_64"
  top: "W_xc_x_65"
  top: "W_xc_x_66"
  top: "W_xc_x_67"
  top: "W_xc_x_68"
  top: "W_xc_x_69"
  top: "W_xc_x_70"
  top: "W_xc_x_71"
  top: "W_xc_x_72"
  top: "W_xc_x_73"
  top: "W_xc_x_74"
  top: "W_xc_x_75"
  top: "W_xc_x_76"
  top: "W_xc_x_77"
  top: "W_xc_x_78"
  top: "W_xc_x_79"
  top: "W_xc_x_80"
  phase: TEST
  slice_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_0"
  type: "Scale"
  bottom: "h_0"
  bottom: "cont_1_lstm1_cont_slice_0_split_0"
  top: "h_conted_0"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "lstm1_transform_1"
  type: "InnerProductRistretto"
  bottom: "h_conted_0"
  top: "W_hc_h_0"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 8
    is_sign_data: 0
  }
}
layer {
  name: "lstm1_gate_input_1"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_0"
  bottom: "W_xc_x_1"
  top: "gate_input_1"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_1"
  type: "LSTMUnitRistretto"
  bottom: "c_0"
  bottom: "gate_input_1"
  bottom: "cont_1_lstm1_cont_slice_0_split_1"
  top: "c_1"
  top: "h_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "h_1_lstm1_unit_1_1_split"
  type: "Split"
  bottom: "h_1"
  top: "h_1_lstm1_unit_1_1_split_0"
  top: "h_1_lstm1_unit_1_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_1"
  type: "Scale"
  bottom: "h_1_lstm1_unit_1_1_split_0"
  bottom: "cont_2_lstm1_cont_slice_1_split_0"
  top: "h_conted_1"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_2"
  type: "InnerProductRistretto"
  bottom: "h_conted_1"
  top: "W_hc_h_1"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 4
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_2"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_1"
  bottom: "W_xc_x_2"
  top: "gate_input_2"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_2"
  type: "LSTMUnitRistretto"
  bottom: "c_1"
  bottom: "gate_input_2"
  bottom: "cont_2_lstm1_cont_slice_1_split_1"
  top: "c_2"
  top: "h_2"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 6
    is_sign_data: 1
  }
}
layer {
  name: "h_2_lstm1_unit_2_1_split"
  type: "Split"
  bottom: "h_2"
  top: "h_2_lstm1_unit_2_1_split_0"
  top: "h_2_lstm1_unit_2_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_2"
  type: "Scale"
  bottom: "h_2_lstm1_unit_2_1_split_0"
  bottom: "cont_3_lstm1_cont_slice_2_split_0"
  top: "h_conted_2"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_3"
  type: "InnerProductRistretto"
  bottom: "h_conted_2"
  top: "W_hc_h_2"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 4
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_3"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_2"
  bottom: "W_xc_x_3"
  top: "gate_input_3"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_3"
  type: "LSTMUnitRistretto"
  bottom: "c_2"
  bottom: "gate_input_3"
  bottom: "cont_3_lstm1_cont_slice_2_split_1"
  top: "c_3"
  top: "h_3"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 5
    is_sign_data: 1
  }
}
layer {
  name: "h_3_lstm1_unit_3_1_split"
  type: "Split"
  bottom: "h_3"
  top: "h_3_lstm1_unit_3_1_split_0"
  top: "h_3_lstm1_unit_3_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_3"
  type: "Scale"
  bottom: "h_3_lstm1_unit_3_1_split_0"
  bottom: "cont_4_lstm1_cont_slice_3_split_0"
  top: "h_conted_3"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_4"
  type: "InnerProductRistretto"
  bottom: "h_conted_3"
  top: "W_hc_h_3"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_4"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_3"
  bottom: "W_xc_x_4"
  top: "gate_input_4"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_4"
  type: "LSTMUnitRistretto"
  bottom: "c_3"
  bottom: "gate_input_4"
  bottom: "cont_4_lstm1_cont_slice_3_split_1"
  top: "c_4"
  top: "h_4"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 5
    is_sign_data: 1
  }
}
layer {
  name: "h_4_lstm1_unit_4_1_split"
  type: "Split"
  bottom: "h_4"
  top: "h_4_lstm1_unit_4_1_split_0"
  top: "h_4_lstm1_unit_4_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_4"
  type: "Scale"
  bottom: "h_4_lstm1_unit_4_1_split_0"
  bottom: "cont_5_lstm1_cont_slice_4_split_0"
  top: "h_conted_4"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_5"
  type: "InnerProductRistretto"
  bottom: "h_conted_4"
  top: "W_hc_h_4"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_5"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_4"
  bottom: "W_xc_x_5"
  top: "gate_input_5"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_5"
  type: "LSTMUnitRistretto"
  bottom: "c_4"
  bottom: "gate_input_5"
  bottom: "cont_5_lstm1_cont_slice_4_split_1"
  top: "c_5"
  top: "h_5"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 4
    is_sign_data: 1
  }
}
layer {
  name: "h_5_lstm1_unit_5_1_split"
  type: "Split"
  bottom: "h_5"
  top: "h_5_lstm1_unit_5_1_split_0"
  top: "h_5_lstm1_unit_5_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_5"
  type: "Scale"
  bottom: "h_5_lstm1_unit_5_1_split_0"
  bottom: "cont_6_lstm1_cont_slice_5_split_0"
  top: "h_conted_5"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_6"
  type: "InnerProductRistretto"
  bottom: "h_conted_5"
  top: "W_hc_h_5"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_6"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_5"
  bottom: "W_xc_x_6"
  top: "gate_input_6"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_6"
  type: "LSTMUnitRistretto"
  bottom: "c_5"
  bottom: "gate_input_6"
  bottom: "cont_6_lstm1_cont_slice_5_split_1"
  top: "c_6"
  top: "h_6"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 4
    is_sign_data: 1
  }
}
layer {
  name: "h_6_lstm1_unit_6_1_split"
  type: "Split"
  bottom: "h_6"
  top: "h_6_lstm1_unit_6_1_split_0"
  top: "h_6_lstm1_unit_6_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_6"
  type: "Scale"
  bottom: "h_6_lstm1_unit_6_1_split_0"
  bottom: "cont_7_lstm1_cont_slice_6_split_0"
  top: "h_conted_6"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_7"
  type: "InnerProductRistretto"
  bottom: "h_conted_6"
  top: "W_hc_h_6"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_7"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_6"
  bottom: "W_xc_x_7"
  top: "gate_input_7"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_7"
  type: "LSTMUnitRistretto"
  bottom: "c_6"
  bottom: "gate_input_7"
  bottom: "cont_7_lstm1_cont_slice_6_split_1"
  top: "c_7"
  top: "h_7"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 4
    is_sign_data: 1
  }
}
layer {
  name: "h_7_lstm1_unit_7_1_split"
  type: "Split"
  bottom: "h_7"
  top: "h_7_lstm1_unit_7_1_split_0"
  top: "h_7_lstm1_unit_7_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_7"
  type: "Scale"
  bottom: "h_7_lstm1_unit_7_1_split_0"
  bottom: "cont_8_lstm1_cont_slice_7_split_0"
  top: "h_conted_7"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_8"
  type: "InnerProductRistretto"
  bottom: "h_conted_7"
  top: "W_hc_h_7"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_8"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_7"
  bottom: "W_xc_x_8"
  top: "gate_input_8"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_8"
  type: "LSTMUnitRistretto"
  bottom: "c_7"
  bottom: "gate_input_8"
  bottom: "cont_8_lstm1_cont_slice_7_split_1"
  top: "c_8"
  top: "h_8"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 4
    is_sign_data: 1
  }
}
layer {
  name: "h_8_lstm1_unit_8_1_split"
  type: "Split"
  bottom: "h_8"
  top: "h_8_lstm1_unit_8_1_split_0"
  top: "h_8_lstm1_unit_8_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_8"
  type: "Scale"
  bottom: "h_8_lstm1_unit_8_1_split_0"
  bottom: "cont_9_lstm1_cont_slice_8_split_0"
  top: "h_conted_8"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_9"
  type: "InnerProductRistretto"
  bottom: "h_conted_8"
  top: "W_hc_h_8"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_9"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_8"
  bottom: "W_xc_x_9"
  top: "gate_input_9"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_9"
  type: "LSTMUnitRistretto"
  bottom: "c_8"
  bottom: "gate_input_9"
  bottom: "cont_9_lstm1_cont_slice_8_split_1"
  top: "c_9"
  top: "h_9"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "h_9_lstm1_unit_9_1_split"
  type: "Split"
  bottom: "h_9"
  top: "h_9_lstm1_unit_9_1_split_0"
  top: "h_9_lstm1_unit_9_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_9"
  type: "Scale"
  bottom: "h_9_lstm1_unit_9_1_split_0"
  bottom: "cont_10_lstm1_cont_slice_9_split_0"
  top: "h_conted_9"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_10"
  type: "InnerProductRistretto"
  bottom: "h_conted_9"
  top: "W_hc_h_9"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_10"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_9"
  bottom: "W_xc_x_10"
  top: "gate_input_10"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_10"
  type: "LSTMUnitRistretto"
  bottom: "c_9"
  bottom: "gate_input_10"
  bottom: "cont_10_lstm1_cont_slice_9_split_1"
  top: "c_10"
  top: "h_10"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "h_10_lstm1_unit_10_1_split"
  type: "Split"
  bottom: "h_10"
  top: "h_10_lstm1_unit_10_1_split_0"
  top: "h_10_lstm1_unit_10_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_10"
  type: "Scale"
  bottom: "h_10_lstm1_unit_10_1_split_0"
  bottom: "cont_11_lstm1_cont_slice_10_split_0"
  top: "h_conted_10"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_11"
  type: "InnerProductRistretto"
  bottom: "h_conted_10"
  top: "W_hc_h_10"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_11"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_10"
  bottom: "W_xc_x_11"
  top: "gate_input_11"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_11"
  type: "LSTMUnitRistretto"
  bottom: "c_10"
  bottom: "gate_input_11"
  bottom: "cont_11_lstm1_cont_slice_10_split_1"
  top: "c_11"
  top: "h_11"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "h_11_lstm1_unit_11_1_split"
  type: "Split"
  bottom: "h_11"
  top: "h_11_lstm1_unit_11_1_split_0"
  top: "h_11_lstm1_unit_11_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_11"
  type: "Scale"
  bottom: "h_11_lstm1_unit_11_1_split_0"
  bottom: "cont_12_lstm1_cont_slice_11_split_0"
  top: "h_conted_11"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_12"
  type: "InnerProductRistretto"
  bottom: "h_conted_11"
  top: "W_hc_h_11"
  param {
    name: "W_hc"
  }
  phase: TEST
  inner_product_param {
    num_output: 400
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    axis: 2
  }
  quantization_param {
    bw_params: 8
    fl_params: 5
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_gate_input_12"
  type: "EltwiseRistretto"
  bottom: "W_hc_h_11"
  bottom: "W_xc_x_12"
  top: "gate_input_12"
  phase: TEST
  eltwise_param {
    operation: SUM
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 2
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_unit_12"
  type: "LSTMUnitRistretto"
  bottom: "c_11"
  bottom: "gate_input_12"
  bottom: "cont_12_lstm1_cont_slice_11_split_1"
  top: "c_12"
  top: "h_12"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 3
    is_sign_data: 1
  }
}
layer {
  name: "h_12_lstm1_unit_12_1_split"
  type: "Split"
  bottom: "h_12"
  top: "h_12_lstm1_unit_12_1_split_0"
  top: "h_12_lstm1_unit_12_1_split_1"
  phase: TEST
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_h_conted_12"
  type: "Scale"
  bottom: "h_12_lstm1_unit_12_1_split_0"
  bottom: "cont_13_lstm1_cont_slice_12_split_0"
  top: "h_conted_12"
  phase: TEST
  scale_param {
    axis: 0
  }
  quantization_param {
    bw_params: 8
    fl_params: 0
    bw_layer_data: 8
    fl_layer_data: 7
    is_sign_data: 1
  }
}
layer {
  name: "lstm1_transform_13"
